read_verilog C:\Users\mjhun\Code\HDLProjects\Latch\latch.v
hierarchy
proc
flatten
tribuf -logic
opt
techmap -map +/techmap.v -map cupl_cells_latch.v
opt
dfflibmap -prepare -liberty cupl_dff.lib
abc -g AND,XOR
clean
dfflibmap -liberty cupl_dff.lib
opt
write_json C:\Users\mjhun\Code\HDLProjects\Latch\latch.json