read_verilog SimpleTest.v
hierarchy
proc
flatten
tribuf -logic
opt
techmap -map +/cupl_techmap.v -map cupl_cells_latch.v
opt
dfflibmap -prepare -liberty cupl_dff.lib
abc -g AND,XOR
clean
dfflibmap -liberty cupl_dff.lib
opt
write_json SimpleTest6.json